IDEA Open Model
OpenModel.TemperatureLoadsOnLine Property
Compatible with IDEA StatiCa v 10.1
 List of temperature load in this load case
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public List<TemperatureLoadOnLine> TemperatureLoadsOnLine { get; set; }
Public Property TemperatureLoadsOnLine As List(Of TemperatureLoadOnLine)
	Get
	Set
public:
property List<TemperatureLoadOnLine^>^ TemperatureLoadsOnLine {
	List<TemperatureLoadOnLine^>^ get ();
	void set (List<TemperatureLoadOnLine^>^ value);
}
Property Value
Type: List<TemperatureLoadOnLine>
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace